global a      #глобальная переменная
def f1(a1,a2,a3,a4=100,a5=200,a6="Rimma"): # объявление функции
    v1 = a1 * 2
    v2 = a2 * 10
    v3 = a3 * 7
    v4 = a4 + a3
    v5 = a5

    # print(v1)
    result  = [v1,v2,v3,v4,v5]   # список

    # return v1, v2, v3 # return нужен всегда
    return result

# result = f1(2,3,4)
ri, r2, r3, r4, r5 = f1(2,3,4)
#print(ri, r2, r3, r4, r5)

#==================================================================

# def f2(*args): # функция на вход принимает любое кол-во порядковых значений/переменных
#     print(args)
#     return args # по умолч возвращает кортеж
#
# nn = f2(3,5,7,9)
#
# print(nn) # кортеж - данные в скобках на выходе

#==================================================================

# def f3(**kvarg):
#     print(kvarg)  # возвращается Словарь - dict
# f3(m1=4, m2=6, m3=9)

#==================================================================

def f4(salary, *args, **kvargs):

    for k, v in kvargs.items():
        print("k=", k, "v=", v)

    print(args)
    print(kvargs)
    print(salary)

f4(1000, 5,7,0, k1=99, k2=88) # сначала порядковые, потом именованные переменные

#==================================================================

